[Killed] BlockStatement
algorithms/binary-search.ts:1:66
-export function binarySearch(arr: number[], key: number): number {
-  let low = 0;
-  let high = arr.length - 1;
-
-  while (low <= high) {
-    const mid = Math.floor((low + high) / 2);
-    if (arr[mid] === key) return mid;
-    if (arr[mid] < key) low = mid + 1;
-    else high = mid - 1;
-  }
-
-  return -1;
-}
+export function binarySearch(arr: number[], key: number): number {}
killedBy: binarySearch contract testing postcondición: índice válido o -1
statusReason: Expected undefined to be greater than or equal 0.

[Survived] ArithmeticOperator
algorithms/binary-search.ts:3:14
 export function binarySearch(arr: number[], key: number): number {
   let low = 0;
-  let high = arr.length - 1;
+  let high = arr.length + 1;
 
   while (low <= high) {

[Killed] ConditionalExpression
algorithms/binary-search.ts:7:9
 
   while (low <= high) {
     const mid = Math.floor((low + high) / 2);
-    if (arr[mid] === key) return mid;
+    if (false) return mid;
     if (arr[mid] < key) low = mid + 1;
     else high = mid - 1;
killedBy: binarySearch contract testing postcondición: índice válido o -1
statusReason: Expected -1 to be greater than or equal 0.

[Killed] EqualityOperator
algorithms/binary-search.ts:7:9
 
   while (low <= high) {
     const mid = Math.floor((low + high) / 2);
-    if (arr[mid] === key) return mid;
+    if (arr[mid] !== key) return mid;
     if (arr[mid] < key) low = mid + 1;
     else high = mid - 1;
killedBy: binarySearch contract testing postcondición: índice válido o -1
statusReason: Expected 2 to be 3.

[Killed] ConditionalExpression
algorithms/binary-search.ts:8:9
   while (low <= high) {
     const mid = Math.floor((low + high) / 2);
     if (arr[mid] === key) return mid;
-    if (arr[mid] < key) low = mid + 1;
+    if (true) low = mid + 1;
     else high = mid - 1;
   }
killedBy: binarySearch property-based cumple la propiedad f(A,k) = i → (A[i] = k) ∨ (i = -1 ∧ k ∉ A)
statusReason: Expected true to be false.

[Killed] EqualityOperator
algorithms/binary-search.ts:8:9
   while (low <= high) {
     const mid = Math.floor((low + high) / 2);
     if (arr[mid] === key) return mid;
-    if (arr[mid] < key) low = mid + 1;
+    if (arr[mid] >= key) low = mid + 1;
     else high = mid - 1;
   }
killedBy: binarySearch contract testing postcondición: índice válido o -1
statusReason: Expected -1 to be greater than or equal 0.

[Timeout] ArithmeticOperator
algorithms/binary-search.ts:9:17
     const mid = Math.floor((low + high) / 2);
     if (arr[mid] === key) return mid;
     if (arr[mid] < key) low = mid + 1;
-    else high = mid - 1;
+    else high = mid + 1;
   }
 
